doc/www/org/index.org
#+TITLE:      SL-COMP 2019
#+AUTHOR:     Mihaela Sighireanu
#+EMAIL:      sl-comp@googlegroups.com
#+LANGUAGE:   en
#+CATEGORY:   competition
#+OPTIONS:    H:2 num:nil
#+OPTIONS:    toc:auto
#+OPTIONS:    \n:nil ::t |:t ^:t -:t f:t *:t d:(HIDE)
#+OPTIONS:    tex:t
#+OPTIONS:    html-preamble:nil
#+OPTIONS:    html-postamble:auto
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/stylebig.css"/>
#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler

#+MACRO: sl-comp SL-COMP
#+MACRO: SL [[http://www0.cs.ucl.ac.uk/staff/p.ohearn/SeparationLogic/Separation_Logic/SL_Home.html][Separation Logic]]
#+MACRO: SMT-COMP [[http://smtcomp.sourceforge.net][SMT-COMP]]
#+MACRO: SAT-COMP [[http://www.satcompetition.org][SAT]]
#+MACRO: SMT-LIB  [[http://smtlib.cs.uiowa.edu/index.shtml][SMT-LIB]]
#+MACRO: StarExec [[https://www.starexec.org][StarExec]]

#+MACRO: Asterix [[https://sl-comp.github.io/docs/solvers.html#Asterix][Asterix]]
#+MACRO: ComSPEN [[https://sl-comp.github.io/docs/solvers.html#ComSPEN][ComSPEN]]
#+MACRO: Cyclist [[https://sl-comp.github.io/docs/solvers.html#Cyclist][Cyclist]]
#+MACRO: CVC4    [[https://sl-comp.github.io/docs/solvers.html#CVC4][CVC4]]
#+MACRO: Harrsh  [[https://sl-comp.github.io/docs/solvers.html#Harrsh][Harrsh]]
#+MACRO: S2S     [[https://sl-comp.github.io/docs/solvers.html#S2S][S2S]]
#+MACRO: Sleek   [[https://sl-comp.github.io/docs/solvers.html#Sleek][Sleek]]
#+MACRO: SLSAT   [[https://sl-comp.github.io/docs/solvers.html#SLSAT][SLSAT]]
#+MACRO: Songbird  [[https://sl-comp.github.io/docs/solvers.html#Songbird][Songbird]]
#+MACRO: SPEN    [[https://sl-comp.github.io/docs/solvers.html#SPEN][SPEN]]


* Synopsis
   This is the 3rd edition of 
   {{{sl-comp}}}, an initiative for collecting decision problems in {{{SL}}}
   and solvers dealing with such problems.

   This initiative started in 2014 and it was inspired by the very
   popular initiatives on other theories, like 
   first-order theories for {{{SMT-COMP}}} and 
   Boolean constraints for {{{SAT-COMP}}}.

   For more details, see competition's [[https://sl-comp.github.io][web site]].

* News and Key Dates
  - *April 6th, 2019*: Presentation of SL-COMP'19 at [[https://tacas.info/toolympics.php][TOOLympics 2019]]
  - *March 31, 2019*: Last official run of SL-COMP'19 on [[https://starexec.org][StarExec]]
  - *March 22, 2019*: First official run of SL-COMP'19 on [[https://starexec.org][StarExec]]
  - March 8, 2019: First training run of SL-COMP'19 on [[https://starexec.org][StarExec]]
  - February 25, 2019: Preliminary description of SL-COMP'19 at [[https://tacas.info/toolympics.php][TOOLympics 2019]] 
    available at [[https://github.com/sl-comp/SL-COMP19/tree/master/doc/report/toolympics19/main.pdf][competition's web site]]
  - January 8, 2019: Deadline for registration of solvers for SL-COMP 2019 at 
     [[https://easychair.org/conferences/?conf=slcomp19][easychair submission site]]
  - December 7, 2018: Call for participation to SL-COMP 2019 at [[https://tacas.info/toolympics.php][TOOLympics 2019]]

* Specifications and rules

  The same input format as for SL-COMP 2018 edition, detailed on [[https://sl-comp.github.io][competition web site]].

  The competition takes place on the {{{StarExec}}} platform based on the following rules:
  - timeout for solving one problem: 2400 seconds except for division =qf_shls_*= whre timeout is 600 seconds
  - maximum memory: 10 GB
  - no scrambling
  - official pre-processors accepted
  
  The scoring scheme used is explained [[file:gloss.html#SCORE][here]]

#+NAME: bench
