doc/www/www/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-05 Fri 22:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>SL-COMP 2019</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mihaela Sighireanu" />
<link rel="stylesheet" type="text/css" href="css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="css/stylebig.css"/>
</head>
<body>
<div id="content">
<h1 class="title">SL-COMP 2019</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga09b26e">Synopsis</a></li>
<li><a href="#org77270ea">News and Key Dates</a></li>
<li><a href="#orgc03e8f3">Specifications and rules</a></li>
<li><a href="#org2019834">Benchmarks and divisions</a></li>
<li><a href="#org9eec540">Participants</a></li>
<li><a href="#org86ad46d">Results</a>
<ul>
<li><a href="#org5028cdc">Division <code>qf_bsl_sat</code>: 46 problems, 1 solver</a></li>
<li><a href="#org83109e9">Division <code>qf_bsllia_sat</code>: 24 problems, 1 solver</a></li>
<li><a href="#orgcfab201">Division <code>qf_shid_entl</code>: 312 problems, 6 solvers</a></li>
<li><a href="#org9926a3e">Division <code>qf_shid_sat</code>: 99 problems, 5 solvers</a></li>
<li><a href="#orgeb0de77">Division <code>qf_shidlia_entl</code>: 61 problems, 4 solvers</a></li>
<li><a href="#org18f360f">Division <code>qf_shidlia_sat</code>: 33 problems, 4 solvers</a></li>
<li><a href="#orgd4c9b2a">Division <code>qf_shlid_entl</code>: 60 problems, 8 solvers</a></li>
<li><a href="#org8f6aaf9">Division <code>qf_shls_entl</code>: 296 problems, 9 solvers</a></li>
<li><a href="#org4c363f9">Division <code>qf_shls_sat</code>: 110 problems, 8 solvers</a></li>
<li><a href="#orgfcadab9">Division <code>shid_entl</code>: 73 problems, 5 solvers</a></li>
<li><a href="#orgd31ec15">Division <code>shidlia_entl</code>: 181 problems, 3 solvers</a></li>
</ul>
</li>
<li><a href="#orgdb4f635">Committee</a></li>
<li><a href="#org54532c1">Mailing list</a></li>
</ul>
</div>
</div>


<div id="outline-container-orga09b26e" class="outline-2">
<h2 id="orga09b26e">Synopsis</h2>
<div class="outline-text-2" id="text-orga09b26e">
<p>
This is the 3rd edition of 
SL-COMP, an initiative for collecting decision problems in <a href="http://www0.cs.ucl.ac.uk/staff/p.ohearn/SeparationLogic/Separation_Logic/SL_Home.html">Separation Logic</a>
and solvers dealing with such problems.
</p>

<p>
This initiative started in 2014 and it was inspired by the very
popular initiatives on other theories, like 
first-order theories for <a href="http://smtcomp.sourceforge.net">SMT-COMP</a> and 
Boolean constraints for <a href="http://www.satcompetition.org">SAT</a>.
</p>

<p>
For more details, see competition's <a href="https://sl-comp.github.io">web site</a>.
</p>
</div>
</div>

<div id="outline-container-org77270ea" class="outline-2">
<h2 id="org77270ea">News and Key Dates</h2>
<div class="outline-text-2" id="text-org77270ea">
<ul class="org-ul">
<li><b>April 6th, 2019</b>: Presentation of SL-COMP'19 at <a href="https://tacas.info/toolympics.php">TOOLympics 2019</a></li>
<li><b>March 31, 2019</b>: Last official run of SL-COMP'19 on <a href="https://starexec.org">StarExec</a></li>
<li><b>March 22, 2019</b>: First official run of SL-COMP'19 on <a href="https://starexec.org">StarExec</a></li>
<li>March 8, 2019: First training run of SL-COMP'19 on <a href="https://starexec.org">StarExec</a></li>
<li>February 25, 2019: Preliminary description of SL-COMP'19 at <a href="https://tacas.info/toolympics.php">TOOLympics 2019</a> 
available at <a href="https://github.com/sl-comp/SL-COMP19/tree/master/doc/report/toolympics19/main.pdf">competition's web site</a></li>
<li>January 8, 2019: Deadline for registration of solvers for SL-COMP 2019 at 
<a href="https://easychair.org/conferences/?conf=slcomp19">easychair submission site</a></li>
<li>December 7, 2018: Call for participation to SL-COMP 2019 at <a href="https://tacas.info/toolympics.php">TOOLympics 2019</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc03e8f3" class="outline-2">
<h2 id="orgc03e8f3">Specifications and rules</h2>
<div class="outline-text-2" id="text-orgc03e8f3">
<p>
The same input format as for SL-COMP 2018 edition, detailed on <a href="https://sl-comp.github.io">competition web site</a>.
</p>

<p>
The competition takes place on the <a href="https://www.starexec.org">StarExec</a> platform based on the following rules:
</p>
<ul class="org-ul">
<li>timeout for solving one problem: 2400 seconds except for division <code>qf_shls_*</code> whre timeout is 600 seconds</li>
<li>maximum memory: 10 GB</li>
<li>no scrambling</li>
<li>official pre-processors accepted</li>
</ul>

<p>
The scoring scheme used is explained <a href="gloss.html#SCORE">here</a>
</p>
</div>
</div>
