doc/www/org/index.org
* Benchmarks and divisions

  This edition uses the same set of problems than [[https://github.com/sl-comp/SL-COMP18/tree/master/bench][SL-COMP 2018 edition]],
  i.e., 1296 problems split into the same 11 divisions:
  + Satisfiability checking:
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shls_sat][=qf_shls_sat=]]: for quantifier free (QF) formulas in the symbolic heaps (SH) fragment using only acyclic singly linked lists
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shid_sat][=qf_shid_sat=]]: for QF formulas in the SH fragment using general inductive definitions (ID)
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shidlia_sat][=qf_shidlia_sat=]]: for QF formulas in the SH fragment with ID and linear integer constraints (LIA)
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_bsl_sat][=qf_bsl_sat=]]: for QF fragment with boolean combination of SL atoms; the quantified version of this division [[https://github.com/sl-comp/SL-COMP18/tree/master/bench/bsl_sat][=bsl_sat=]] has not enough problems to be considered by this edition
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_bsllia_sat][=qf_bsllia_sat=]]: for QF fragment with boolean combination of SL atoms and LIA

  + Entailment checking:
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shls_entl][=qf_shls_entl=]]: for QF formulas in the SH fragment using only acyclic singly linked lists
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shid_entl][=qf_shid_entl=]]: for QF formulas in the SH fragment with ID
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shlid_entl][=qf_shlid_entl=]]: for QF formulas in the SH fragment with linear ID
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/shid_entl][=shid_entl=]]: for formulas in the SH fragment with ID
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shidlia_entl][=qf_shidlia_entl=]]: for formulas in the SH fragment with ID and LIA
    - [[https://github.com/sl-comp/SL-COMP19/tree/master/bench/shidlia_entl][=shidlia_entl=]]: for QF formulas in the SH fragment with IS and LIA

  A set of new problems proposed for division `qf_shid_entl` are on probation at this edition.


- The contributions to the benchmark of SL-COMP are summarized below:

#+ATTR_HTML: :border 2 :rules all :frame border
| Division          | #problems | {{{Asterix}}} | ComSPEN | CVC4 | Cyclist | Harrsh |  S2S | Sleek | Slide | Songbird | SPEN |
|                   |  <4> |  <4> |  <4> |  <4> |  <4> |  <4> |  <4> |  <4> |  <4> |  <4> |  <4> |
|-------------------+------+------+------+------+------+------+------+------+------+------+------|
| =qf_bsl_sat=      |   46 |    0 |    0 |   46 |    0 |    0 |    0 |    0 |    0 |    0 |    0 |
| =qf_bsllia_sat=   |   24 |    0 |    0 |   24 |    0 |    0 |    0 |    0 |    0 |    0 |    0 |
| =qf_shid_entl=    |  312 |    1 |    0 |    0 |   22 |    0 |   59 |   81 |   17 |  132 |   46 |
| =qf_shid_sat=     |   99 |    0 |    0 |    0 |   61 |   29 |    9 |    0 |    0 |    0 |    0 |
| =qf_shidlia_entl= |   61 |    0 |   22 |    0 |    0 |    0 |    0 |    0 |    0 |   39 |    0 |
| =qf_shidlia_sat=  |   33 |    0 |   20 |    0 |    0 |    0 |   13 |    0 |    0 |    0 |    0 |
| =qf_shlid_entl=   |   60 |    0 |    0 |    0 |    0 |    0 |   14 |    0 |    0 |    0 |   46 |
| =qf_shls_entl=    |  296 |  287 |    0 |    0 |    0 |    0 |    9 |    0 |    0 |    0 |    5 |
| =qf_shls_sat=     |  110 |  110 |    0 |    0 |    0 |    0 |    0 |    0 |    0 |    0 |    0 |
| =shid_entl=       |   73 |    0 |    0 |    0 |    0 |    0 |    0 |    0 |    9 |   64 |    0 |
| =shidlia_entl=    |  181 |    0 |    0 |    0 |    0 |    0 |    0 |    0 |    0 |  181 |    0 |
|-------------------+------+------+------+------+------+------+------+------+------+------+------|





