doc/www/www/index.html
<div id="outline-container-org2019834" class="outline-2">
<h2 id="org2019834">Benchmarks and divisions</h2>
<div class="outline-text-2" id="text-org2019834">
<p>
This edition uses the same set of problems than <a href="https://github.com/sl-comp/SL-COMP18/tree/master/bench">SL-COMP 2018 edition</a>,
i.e., 1296 problems split into the same 11 divisions:
</p>
<ul class="org-ul">
<li>Satisfiability checking:
<ul class="org-ul">
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shls_sat"><code>qf_shls_sat</code></a>: for quantifier free (QF) formulas in the symbolic heaps (SH) fragment using only acyclic singly linked lists</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shid_sat"><code>qf_shid_sat</code></a>: for QF formulas in the SH fragment using general inductive definitions (ID)</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shidlia_sat"><code>qf_shidlia_sat</code></a>: for QF formulas in the SH fragment with ID and linear integer constraints (LIA)</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_bsl_sat"><code>qf_bsl_sat</code></a>: for QF fragment with boolean combination of SL atoms; the quantified version of this division <a href="https://github.com/sl-comp/SL-COMP18/tree/master/bench/bsl_sat"><code>bsl_sat</code></a> has not enough problems to be considered by this edition</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_bsllia_sat"><code>qf_bsllia_sat</code></a>: for QF fragment with boolean combination of SL atoms and LIA</li>
</ul></li>

<li>Entailment checking:
<ul class="org-ul">
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shls_entl"><code>qf_shls_entl</code></a>: for QF formulas in the SH fragment using only acyclic singly linked lists</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shid_entl"><code>qf_shid_entl</code></a>: for QF formulas in the SH fragment with ID</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shlid_entl"><code>qf_shlid_entl</code></a>: for QF formulas in the SH fragment with linear ID</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/shid_entl"><code>shid_entl</code></a>: for formulas in the SH fragment with ID</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/qf_shidlia_entl"><code>qf_shidlia_entl</code></a>: for formulas in the SH fragment with ID and LIA</li>
<li><a href="https://github.com/sl-comp/SL-COMP19/tree/master/bench/shidlia_entl"><code>shidlia_entl</code></a>: for QF formulas in the SH fragment with IS and LIA</li>
</ul></li>
</ul>

<p>
A set of new problems proposed for division `qf<sub>shid</sub><sub>entl</sub>` are on probation at this edition.
</p>


<ul class="org-ul">
<li>The contributions to the benchmark of SL-COMP are summarized below:</li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Division</th>
<th scope="col" class="org-right">#problems</th>
<th scope="col" class="org-right"><a href="https://sl-comp.github.io/docs/solvers.html#Asterix">Asterix</a></th>
<th scope="col" class="org-right">ComSPEN</th>
<th scope="col" class="org-right">CVC4</th>
<th scope="col" class="org-right">Cyclist</th>
<th scope="col" class="org-right">Harrsh</th>
<th scope="col" class="org-right">S2S</th>
<th scope="col" class="org-right">Sleek</th>
<th scope="col" class="org-right">Slide</th>
<th scope="col" class="org-right">Songbird</th>
<th scope="col" class="org-right">SPEN</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>qf_bsl_sat</code></td>
<td class="org-right">46</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">46</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left"><code>qf_bsllia_sat</code></td>
<td class="org-right">24</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">24</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left"><code>qf_shid_entl</code></td>
<td class="org-right">312</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">22</td>
<td class="org-right">0</td>
<td class="org-right">59</td>
<td class="org-right">81</td>
<td class="org-right">17</td>
<td class="org-right">132</td>
<td class="org-right">46</td>
</tr>

<tr>
<td class="org-left"><code>qf_shid_sat</code></td>
<td class="org-right">99</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">61</td>
<td class="org-right">29</td>
<td class="org-right">9</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left"><code>qf_shidlia_entl</code></td>
<td class="org-right">61</td>
<td class="org-right">0</td>
<td class="org-right">22</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">39</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left"><code>qf_shidlia_sat</code></td>
<td class="org-right">33</td>
<td class="org-right">0</td>
<td class="org-right">20</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">13</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left"><code>qf_shlid_entl</code></td>
<td class="org-right">60</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">14</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">46</td>
</tr>

<tr>
<td class="org-left"><code>qf_shls_entl</code></td>
<td class="org-right">296</td>
<td class="org-right">287</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">9</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-left"><code>qf_shls_sat</code></td>
<td class="org-right">110</td>
<td class="org-right">110</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left"><code>shid_entl</code></td>
<td class="org-right">73</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">9</td>
<td class="org-right">64</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left"><code>shidlia_entl</code></td>
<td class="org-right">181</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">181</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
</div>
</div>
