doc/www/org/index.org
* Participants
#+NAME: solvers
  These are the solvers participating in the SL-COMP 2019.

#+ATTR_HTML: :border 2 :rules all :frame border
|------------+-------------+------------+--------------------+----------------------------|
| Solver     | Preliminary |      Final | System description | Contact                    |
|            |  version id | version id |                    | for StarExec               |
|------------+-------------+------------+--------------------+----------------------------|
| {{{Asterix}}}    |       20618 |      20618 | [[https://sl-comp.github.io/docs/solvers.html#Asterix][Asterix]] | [[mailto:juannavarroperez@gmail.com][Juan Antonio Navarro Pérez]] |
|------------+-------------+------------+--------------------+----------------------------|
| ComSPEN    |       22337 |      22337 | [[https://sl-comp.github.io/docs/solvers.html#ComSPEN][ComSPEN]] | [[mailto:gaochong@ios.ac.cn][Chong Gao]]                  |
|------------+-------------+------------+--------------------+----------------------------|
| CVC4       |       20439 |      20439 | [[https://sl-comp.github.io/docs/solvers.html#CVC4][CVC4-SL]]            | [[mailto:andrew.j.reynolds@gmail.com][Andrew Reynolds]]            |
|------------+-------------+------------+--------------------+----------------------------|
| Cyclist-SL |        1136 |      22685 | [[https://sl-comp.github.io/docs/solvers.html#Cyclist-SL][Cyclist-SL]]         | [[mailto:nikos.gorogiannis@gmail.com][Nikos Gorogiannis]]          |
|------------+-------------+------------+--------------------+----------------------------|
| Harrsh     |       22424 |      22687 | [[https://sl-comp.github.io/docs/solvers.html#Harrsh][Harrsh]]             | [[mailto:jkatelaan@forsyte.at][Jens Katelaan]]              |
|------------+-------------+------------+--------------------+----------------------------|
| S2S        |       22394 |      22440 | [[https://sl-comp.github.io/docs/solvers.html#S2S][S2S]]                | [[mailto:lequangloc@gmail.com][Le Quang Loc]]               |
|------------+-------------+------------+--------------------+----------------------------|
| Sleek      |       20564 |      20564 | [[https://sl-comp.github.io/docs/solvers.html#Sleek][Sleek]]              | [[mailto:benedictleejh@gmail.com][Benedict Lee]]               |
|------------+-------------+------------+--------------------+----------------------------|
| Slide      |       20623 |      20623 | [[https://sl-comp.github.io/docs/solvers.html#Slide][Slide]]              | [[mailto:rogalew@fit.vutbr.cz][Adam Rogalewicz]]            |
|------------+-------------+------------+--------------------+----------------------------|
| SLSAT      |        1137 |      22694 | [[https://sl-comp.github.io/docs/solvers.html#SLSAT][SLSAT]]              | [[mailto:nikos.gorogiannis@gmail.com][Nikos Gorogiannis]]          |
|------------+-------------+------------+--------------------+----------------------------|
| Songbird   |       20617 |      20617 | [[https://sl-comp.github.io/docs/solvers.html#Songbird][Songbird]]           | [[mailto:taquangtrungvn@gmail.com][Ta Quang Trung]]             |
|------------+-------------+------------+--------------------+----------------------------|
| SPEN       |       20561 |      22729 | [[https://sl-comp.github.io/docs/solvers.html#SPEN][SPEN]]               | [[mailto:mihaela.sighireanu@gmail.com][Mihaela Sighireanu]]         |
|------------+-------------+------------+--------------------+----------------------------|


These are the benchmark divisions in which each solver is competing:

#+ATTR_HTML: :border 2 :rules all :frame border
|-------------------+------+------+------+------+------+------+------+------+------+------+------+------|
| Division          | #prob | {{{Asterix}}} | ComSPEN | CVC4 | Cyclist | Harrsh | S2S  | Sleek | Slide | SLSAT | Songbird | SPEN |
|                   |  <4> | <4>  | <4>  | <4>  | <4>  | <4>  | <4>  | <4>  | <4>  | <4>  | <4>  | <4>  |
|-------------------+------+------+------+------+------+------+------+------+------+------+------+------|
| =qf_bsl_sat=      |   46 |      |      | X    |      |      |      |      |      |      |      |      |
| =qf_bsllia_sat=   |   24 |      |      | X    |      |      |      |      |      |      |      |      |
| =qf_shid_entl=    |  312 |      |      |      | X    | X    | X    | X    | X    |      | X    |      |
| =qf_shid_sat=     |   99 |      |      |      |      | X    | X    | X    |      | X    | X    |      |
| =qf_shidlia_entl= |   61 |      | X    |      |      |      | X    | X    |      |      | X    |      |
| =qf_shidlia_sat=  |   33 |      | X    |      |      |      | X    | X    |      |      | X    |      |
| =qf_shlid_entl=   |   60 |      | X    |      | X    | X    | X    | X    | X    |      | X    | X    |
| =qf_shls_entl=    |  296 | X    | X    |      | X    | X    | X    | X    | X    |      | X    | X    |
| =qf_shls_sat=     |  110 | X    | X    |      |      | X    | X    | X    |      | X    | X    | X    |
| =shid_entl=       |   73 |      |      |      | X    |      | X    | X    | X    |      | X    |      |
| =shidlia_entl=    |  181 |      |      |      |      |      | X    | X    |      |      | X    |      |
|-------------------+------+------+------+------+------+------+------+------+------+------+------+------|


