doc/www/www/index.html





<div id="outline-container-org9eec540" class="outline-2">
<h2 id="org9eec540">Participants</h2>
<div class="outline-text-2" id="text-org9eec540">
<p>
These are the solvers participating in the SL-COMP 2019.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Solver</th>
<th scope="col" class="org-right">Preliminary</th>
<th scope="col" class="org-right">Final</th>
<th scope="col" class="org-left">System description</th>
<th scope="col" class="org-left">Contact</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">version id</th>
<th scope="col" class="org-right">version id</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">for StarExec</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#Asterix">Asterix</a></td>
<td class="org-right">20618</td>
<td class="org-right">20618</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#Asterix">Asterix</a></td>
<td class="org-left"><a href="mailto:juannavarroperez@gmail.com">Juan Antonio Navarro Pérez</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">ComSPEN</td>
<td class="org-right">22337</td>
<td class="org-right">22337</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#ComSPEN">ComSPEN</a></td>
<td class="org-left"><a href="mailto:gaochong@ios.ac.cn">Chong Gao</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">CVC4</td>
<td class="org-right">20439</td>
<td class="org-right">20439</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#CVC4">CVC4-SL</a></td>
<td class="org-left"><a href="mailto:andrew.j.reynolds@gmail.com">Andrew Reynolds</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Cyclist-SL</td>
<td class="org-right">1136</td>
<td class="org-right">22685</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#Cyclist-SL">Cyclist-SL</a></td>
<td class="org-left"><a href="mailto:nikos.gorogiannis@gmail.com">Nikos Gorogiannis</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Harrsh</td>
<td class="org-right">22424</td>
<td class="org-right">22687</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#Harrsh">Harrsh</a></td>
<td class="org-left"><a href="mailto:jkatelaan@forsyte.at">Jens Katelaan</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">S2S</td>
<td class="org-right">22394</td>
<td class="org-right">22440</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#S2S">S2S</a></td>
<td class="org-left"><a href="mailto:lequangloc@gmail.com">Le Quang Loc</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Sleek</td>
<td class="org-right">20564</td>
<td class="org-right">20564</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#Sleek">Sleek</a></td>
<td class="org-left"><a href="mailto:benedictleejh@gmail.com">Benedict Lee</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Slide</td>
<td class="org-right">20623</td>
<td class="org-right">20623</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#Slide">Slide</a></td>
<td class="org-left"><a href="mailto:rogalew@fit.vutbr.cz">Adam Rogalewicz</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SLSAT</td>
<td class="org-right">1137</td>
<td class="org-right">22694</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#SLSAT">SLSAT</a></td>
<td class="org-left"><a href="mailto:nikos.gorogiannis@gmail.com">Nikos Gorogiannis</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Songbird</td>
<td class="org-right">20617</td>
<td class="org-right">20617</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#Songbird">Songbird</a></td>
<td class="org-left"><a href="mailto:taquangtrungvn@gmail.com">Ta Quang Trung</a></td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">SPEN</td>
<td class="org-right">20561</td>
<td class="org-right">22729</td>
<td class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#SPEN">SPEN</a></td>
<td class="org-left"><a href="mailto:mihaela.sighireanu@gmail.com">Mihaela Sighireanu</a></td>
</tr>
</tbody>
</table>


<p>
These are the benchmark divisions in which each solver is competing:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Division</th>
<th scope="col" class="org-right">#prob</th>
<th scope="col" class="org-left"><a href="https://sl-comp.github.io/docs/solvers.html#Asterix">Asterix</a></th>
<th scope="col" class="org-left">ComSPEN</th>
<th scope="col" class="org-left">CVC4</th>
<th scope="col" class="org-left">Cyclist</th>
<th scope="col" class="org-left">Harrsh</th>
<th scope="col" class="org-left">S2S</th>
<th scope="col" class="org-left">Sleek</th>
<th scope="col" class="org-left">Slide</th>
<th scope="col" class="org-left">SLSAT</th>
<th scope="col" class="org-left">Songbird</th>
<th scope="col" class="org-left">SPEN</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>qf_bsl_sat</code></td>
<td class="org-right">46</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>qf_bsllia_sat</code></td>
<td class="org-right">24</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>qf_shid_entl</code></td>
<td class="org-right">312</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>qf_shid_sat</code></td>
<td class="org-right">99</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>qf_shidlia_entl</code></td>
<td class="org-right">61</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>qf_shidlia_sat</code></td>
<td class="org-right">33</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>qf_shlid_entl</code></td>
<td class="org-right">60</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
</tr>

<tr>
<td class="org-left"><code>qf_shls_entl</code></td>
<td class="org-right">296</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
</tr>

<tr>
<td class="org-left"><code>qf_shls_sat</code></td>
<td class="org-right">110</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
</tr>

<tr>
<td class="org-left"><code>shid_entl</code></td>
<td class="org-right">73</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><code>shidlia_entl</code></td>
<td class="org-right">181</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">X</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
