doc/www/org/index.org
* Results
#+NAME: Results
  - Two runs took place between March 8th and April 3rd, 2019.
  - The final results will be  announced at [[https://tacas.info/toolympics.php][TOOLympics]] during TACAS 2019.
  - The results are provided below using the following [[file:gloss.html][glossary]].

** Division =qf_bsl_sat=: 46 problems, 1 solver
   + [[file:qf_bsl_sat.org][Overview]]
   + [[file:qf_bsl_sat.org::RUN-1][Run 1]]
#   + [[file:qf_bsl_sat.org::CVC4][CVC4]]

** Division =qf_bsllia_sat=: 24 problems, 1 solver
   + [[file:qf_bsllia_sat.org][Overview]]
   + [[file:qf_bsllia_sat.org::RUN-1][Run 1]]
#   + [[file:qf_bsllia_sat.org::CVC4][CVC4]]

** Division =qf_shid_entl=: 312 problems, 6 solvers
   + [[file:qf_shid_entl.org][Overview]]
   + [[file:qf_shid_entl.org::RUN-1][Run 1]]
   + [[file:qf_shid_entl.org::RUN-2][Run 2]]
#   + [[file:qf_shid_entl.org::CYCLIST][CYCLIST-SL]]
#   + [[file:qf_shid_entl.org::HARRSH][Harrsh]]
#   + [[file:qf_shid_entl.org::S2S][S2S]]
#   + [[file:qf_shid_entl.org::SLEEK][SLEEK]]
#   + [[file:qf_shid_entl.org::SLIDE][SLIDE]]
#   + [[file:qf_shid_entl.org::SB][Songbird]]
#   + [[file:qf_shid_entl.org::SPEN][SPEN]]

** Division =qf_shid_sat=: 99 problems, 5 solvers
   + [[file:qf_shid_sat.org][Overview]]
   + [[file:qf_shid_sat.org::RUN-1][Run 1]]
   + [[file:qf_shid_sat.org::RUN-2][Run 2]]
#   + [[file:qf_shid_sat.org::Harrsh][Harrsh]]
#   + [[file:qf_shid_sat.org::S2S][S2S]]
#   + [[file:qf_shid_sat.org::SLEEK][SLEEK]]
#   + [[file:qf_shid_sat.org::CYCLIST][SLSAT]]
#   + [[file:qf_shid_sat.org::SB][Songbird]]
#   + [[file:qf_shid_sat.org::SPEN][SPEN]]

** Division =qf_shidlia_entl=: 61 problems, 4 solvers
   + [[file:qf_shidlia_entl.org][Overview]]
   + [[file:qf_shidlia_entl.org::RUN-1][Run 1]]
   + [[file:qf_shidlia_entl.org::RUN-2][Run 2]]
#   + [[file:qf_shidlia_entl.org::CSPEN][ComSPEN]]
#   + [[file:qf_shidlia_entl.org::S2S][S2S]]
#   + [[file:qf_shidlia_entl.org::SLEEK][SLEEK]]
#   + [[file:qf_shidlia_entl.org::SB][Songbird]]

** Division =qf_shidlia_sat=: 33 problems, 4 solvers
   + [[file:qf_shidlia_sat.org][Overview]]
   + [[file:qf_shidlia_sat.org::RUN-1][Run 1]]
   + [[file:qf_shidlia_sat.org::RUN-2][Run 2]]
#   + [[file:qf_shidlia_sat.org::CSPEN][ComSPEN]]
#   + [[file:qf_shidlia_sat.org::S2S][S2S]]
#   + [[file:qf_shidlia_sat.org::SLEEK][SLEEK]]
#   + [[file:qf_shidlia_sat.org::SB][Songbird]]

** Division =qf_shlid_entl=: 60 problems, 8 solvers
   + [[file:qf_shlid_entl.org][Overview]]
   + [[file:qf_shlid_entl.org::RUN-1][Run 1]]
   + [[file:qf_shlid_entl.org::RUN-2][Run 2]]
#   + [[file:qf_shlid_entl.org::CSPEN][ComSPEN]]
#   + [[file:qf_shlid_entl.org::CYCLIST][CYCLIST-SL]]
#   + [[file:qf_shlid_entl.org#Harrsh][Harrsh]]
#   + [[file:qf_shlid_entl.org::S2S][S2S]]
#   + [[file:qf_shlid_entl.org::SLEEK][SLEEK]]
#   + [[file:qf_shlid_entl.org::SLIDE][SLIDE]]
#   + [[file:qf_shlid_entl.org::SB][Songbird]]
#   + [[file:qf_shlid_entl.org::SPEN][SPEN]]

** Division =qf_shls_entl=: 296 problems, 9 solvers
   + [[file:qf_shls_entl.org][Overview]]
   + [[file:qf_shls_entl.org::RUN-1][Run 1]]
   + [[file:qf_shls_entl.org::RUN-2][Run 2]]
#   + [[file:qf_shls_entl.org::Asterix][Asterix]]
#   + [[file:qf_shls_entl.org::CSPEN][ComSPEN]]
#   + [[file:qf_shls_entl.org::CYCLIST][CYCLIST-SL]]
#   + [[file:qf_shls_entl.org#Harrsh][Harrsh]]
#   + [[file:qf_shls_entl.org::S2S][S2S]]
#   + [[file:qf_shls_entl.org::SLEEK][SLEEK]]
#   + [[file:qf_shls_entl.org::SLIDE][SLIDE]]
#   + [[file:qf_shls_entl.org::SB][Songbird]]
#   + [[file:qf_shls_entl.org::SPEN][SPEN]]

** Division =qf_shls_sat=: 110 problems, 8 solvers
   + [[file:qf_shls_sat.org][Overview]]
   + [[file:qf_shls_sat.org::RUN-1][Run 1]]
   + [[file:qf_shls_sat.org::RUN-2][Run 2]]
#   + [[file:qf_shls_sat.org::Asterix][Asterix]]
#   + [[file:qf_shls_sat.org::CSPEN][ComSPEN]]
#   + [[file:qf_shls_sat.org::HARRSH][Harrsh]]
#   + [[file:qf_shls_sat.org::S2S][S2S]]
#   + [[file:qf_shls_sat.org::SLEEK][SLEEK]]
#   + [[file:qf_shls_sat.org::CYCLIST][SLSAT]]
#   + [[file:qf_shls_sat.org::SB][Songbird]]
#   + [[file:qf_shls_sat.org::SPEN][SPEN]]

** Division =shid_entl=: 73 problems, 5 solvers
   + [[file:shid_entl.org][Overview]]
   + [[file:shid_entl.org::RUN-1][Run 1]]
   + [[file:shid_entl.org::RUN-2][Run 2]]
#   + [[file:shid_entl.org::CYCLIST][CYCLIST-SL]]
#   + [[file:shid_entl.org::S2S][S2S]]
#   + [[file:shid_entl.org::SLEEK][SLEEK]]
#   + [[file:shid_entl.org::SLIDE][SLIDE]]
#   + [[file:shid_entl.org::SB][Songbird]]

** Division =shidlia_entl=: 181 problems, 3 solvers
   + [[file:shidlia_entl.org][Overview]]
   + [[file:shidlia_entl.org::RUN-1][Run 1]]
   + [[file:shidlia_entl.org::RUN-2][Run 2]]
#   + [[file:shidlia_entl.org::S2S][S2S]]
#   + [[file:shidlia_entl.org::SLEEK][SLEEK]]
#   + [[file:shidlia_entl.org::SB][Songbird]]


* Committee

  This edition is run by
  [[http://www.irif.fr/~sighirea/][Mihaela Sighireanu]].

  The competition committee includes a member for each participating solver.

* Mailing list
  Any question related to this competition shall be sent to
  the organisation committee and to the 
  [[https://groups.google.com/forum/?hl=fr#!forum/sl-comp][mailing list]].



# INCLUDE:    sitemap.org
# [[file:sitemap.html][Site Map]] and [[file:theindex.html][index]]

