doc/www/www/index.html


<div id="outline-container-org86ad46d" class="outline-2">
<h2 id="org86ad46d">Results</h2>
<div class="outline-text-2" id="text-org86ad46d">
<ul class="org-ul">
<li>Two runs took place between March 8th and April 3rd, 2019.</li>
<li>The final results will be  announced at <a href="https://tacas.info/toolympics.php">TOOLympics</a> during TACAS 2019.</li>
<li>The results are provided below using the following <a href="gloss.html">glossary</a>.</li>
</ul>
</div>

<div id="outline-container-org5028cdc" class="outline-3">
<h3 id="org5028cdc">Division <code>qf_bsl_sat</code>: 46 problems, 1 solver</h3>
<div class="outline-text-3" id="text-org5028cdc">
<ul class="org-ul">
<li><a href="qf_bsl_sat.html">Overview</a></li>
<li><a href="qf_bsl_sat.html#org2689b68">Run 1</a></li>
</ul>
</div>
</div>

<div id="outline-container-org83109e9" class="outline-3">
<h3 id="org83109e9">Division <code>qf_bsllia_sat</code>: 24 problems, 1 solver</h3>
<div class="outline-text-3" id="text-org83109e9">
<ul class="org-ul">
<li><a href="qf_bsllia_sat.html">Overview</a></li>
<li><a href="qf_bsllia_sat.html#orgfe94d70">Run 1</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcfab201" class="outline-3">
<h3 id="orgcfab201">Division <code>qf_shid_entl</code>: 312 problems, 6 solvers</h3>
<div class="outline-text-3" id="text-orgcfab201">
<ul class="org-ul">
<li><a href="qf_shid_entl.html">Overview</a></li>
<li><a href="qf_shid_entl.html#orgda47184">Run 1</a></li>
<li><a href="qf_shid_entl.html#org1cba6c0">Run 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-org9926a3e" class="outline-3">
<h3 id="org9926a3e">Division <code>qf_shid_sat</code>: 99 problems, 5 solvers</h3>
<div class="outline-text-3" id="text-org9926a3e">
<ul class="org-ul">
<li><a href="qf_shid_sat.html">Overview</a></li>
<li><a href="qf_shid_sat.html#orgfcf3bb5">Run 1</a></li>
<li><a href="qf_shid_sat.html#org9ed018d">Run 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb0de77" class="outline-3">
<h3 id="orgeb0de77">Division <code>qf_shidlia_entl</code>: 61 problems, 4 solvers</h3>
<div class="outline-text-3" id="text-orgeb0de77">
<ul class="org-ul">
<li><a href="qf_shidlia_entl.html">Overview</a></li>
<li><a href="qf_shidlia_entl.html#org25e7977">Run 1</a></li>
<li><a href="qf_shidlia_entl.html#org4f2994d">Run 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-org18f360f" class="outline-3">
<h3 id="org18f360f">Division <code>qf_shidlia_sat</code>: 33 problems, 4 solvers</h3>
<div class="outline-text-3" id="text-org18f360f">
<ul class="org-ul">
<li><a href="qf_shidlia_sat.html">Overview</a></li>
<li><a href="qf_shidlia_sat.html#org1f18e2b">Run 1</a></li>
<li><a href="qf_shidlia_sat.html#orga95db9f">Run 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd4c9b2a" class="outline-3">
<h3 id="orgd4c9b2a">Division <code>qf_shlid_entl</code>: 60 problems, 8 solvers</h3>
<div class="outline-text-3" id="text-orgd4c9b2a">
<ul class="org-ul">
<li><a href="qf_shlid_entl.html">Overview</a></li>
<li><a href="qf_shlid_entl.html#orgc097ed8">Run 1</a></li>
<li><a href="qf_shlid_entl.html#org6673161">Run 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8f6aaf9" class="outline-3">
<h3 id="org8f6aaf9">Division <code>qf_shls_entl</code>: 296 problems, 9 solvers</h3>
<div class="outline-text-3" id="text-org8f6aaf9">
<ul class="org-ul">
<li><a href="qf_shls_entl.html">Overview</a></li>
<li><a href="qf_shls_entl.html#org50b6748">Run 1</a></li>
<li><a href="qf_shls_entl.html#orgf64a2af">Run 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-org4c363f9" class="outline-3">
<h3 id="org4c363f9">Division <code>qf_shls_sat</code>: 110 problems, 8 solvers</h3>
<div class="outline-text-3" id="text-org4c363f9">
<ul class="org-ul">
<li><a href="qf_shls_sat.html">Overview</a></li>
<li><a href="qf_shls_sat.html#org3d76f7d">Run 1</a></li>
<li><a href="qf_shls_sat.html#orgfea4646">Run 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfcadab9" class="outline-3">
<h3 id="orgfcadab9">Division <code>shid_entl</code>: 73 problems, 5 solvers</h3>
<div class="outline-text-3" id="text-orgfcadab9">
<ul class="org-ul">
<li><a href="shid_entl.html">Overview</a></li>
<li><a href="shid_entl.html#orgba844a6">Run 1</a></li>
<li><a href="shid_entl.html#org2584695">Run 2</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd31ec15" class="outline-3">
<h3 id="orgd31ec15">Division <code>shidlia_entl</code>: 181 problems, 3 solvers</h3>
<div class="outline-text-3" id="text-orgd31ec15">
<ul class="org-ul">
<li><a href="shidlia_entl.html">Overview</a></li>
<li><a href="shidlia_entl.html#org1b73ac6">Run 1</a></li>
<li><a href="shidlia_entl.html#orgba1951b">Run 2</a></li>
</ul>
</div>
</div>
</div>


<div id="outline-container-orgdb4f635" class="outline-2">
<h2 id="orgdb4f635">Committee</h2>
<div class="outline-text-2" id="text-orgdb4f635">
<p>
This edition is run by
<a href="http://www.irif.fr/~sighirea/">Mihaela Sighireanu</a>.
</p>

<p>
The competition committee includes a member for each participating solver.
</p>
</div>
</div>

<div id="outline-container-org54532c1" class="outline-2">
<h2 id="org54532c1">Mailing list</h2>
<div class="outline-text-2" id="text-org54532c1">
<p>
Any question related to this competition shall be sent to
the organisation committee and to the 
<a href="https://groups.google.com/forum/?hl=fr#!forum/sl-comp">mailing list</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mihaela Sighireanu</p>
<p class="date">Created: 2019-04-05 Fri 22:44</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
